Revit 2024 API
IViewSheetSet.OrderedViewList Property
 Ordered views.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
IReadOnlyList<View> OrderedViewList { get; set; }
Visual Basic
Property OrderedViewList As IReadOnlyList(Of View)
	Get
	Set
Visual C++
property IReadOnlyList<View^>^ OrderedViewList {
	IReadOnlyList<View^>^ get ();
	void set (IReadOnlyList<View^>^ value);
}
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  Thrown when the input ordered view list is null.
Autodesk.Revit.Exceptions.InvalidOperationException |  Thrown when the set operation failed due to invalid view which cannot be printed.
See Also
IViewSheetSet Interface
Autodesk.Revit.DB Namespace